Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/three-kittens-and-chicken-little-omegat.tmx
Source language: en_us
Languages: chr

source: Where are you all going?" said Ducky Lucky.
chr: ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᏌᏬᏄ ᎧᏬᏄ.

source: Where are you all going?" said Foxy Loxy.
chr: ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: Where are you all going?" said Goosey Loosey.
chr: ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: Where are you all going?" said Turkey Lurkey.
chr: ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᎬᏌ ᎬᎾ.

source: Where are you going, Cocky Locky?
chr: ᎭᏢ ᎮᎦ, ᏨᏨᏯ ᎠᏨᏯ?

source: Where are you going, Ducky Lucky?
chr: ᎭᏢ ᎮᎦ, ᏌᏬᏄ ᎧᏬᏄ?

source: Where are you going, Goosey Loosey?
chr: ᎭᏢ ᎮᎦ ᏏᏏ ᏌᏌ?

source: Where are you going, Henny Penny?
chr: ᎭᏢ ᎮᎦ, ᏏᎩᏏ ᎠᎩᏏ?

source: Where are you going, Henny Penny?" said Cocky Locky.
chr: ᎭᏢ ᎮᎦ, ᏏᎩᏏ ᎠᎩᏏ?” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: Where are you going, Turkey Lurkey?
chr: ᎭᏢ ᎮᎦ ᎬᏌ ᎬᎾ?

source: Where shall we hunt for them?
chr: ᎭᏢ ᏦᎩᏯᎸᏍᏗ?

source: Where shall we hunt?
chr: ᎭᏢ ᏦᎩᏯᎸᏍᏗ?

source: Where shall we look for them?
chr: ᎭᏢ ᏦᎩᏯᏍᏗ?

source: Where, where are they?
chr: ᎭᏢ? ᎭᏢ ᎥᏍᎩᎾ?

source: Why, why, why!
chr: ᎦᏙ, ᎦᏙ, ᎦᏙ!

source: Why, why, why!"
chr: ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: Why, why, why!”
chr: ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: Yes, if we soil them.
chr: ᎥᎥ, ᏗᎦᏓᎭ ᏱᎾᎾᎵᏍᏗ.

source: Yes, we have lost our mittens.
chr: ᎥᎥ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ.

source: You all tell me what it was."
chr: ᎢᏍᎩᏃᎮᏏ Ꮎ ᎪᎱᏍᏗ ᎨᏎ.”

source: You are naughty kittens.
chr: ᏪᏌ ᎠᏂᏓ, ᏂᎯ ᎢᏥᏲ.

source: You good little kittens,
chr: ᏂᎯ ᎠᏃᏍᏓ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ,

source: You laughed at us.
chr: ᎢᏍᎩᏰᏘᏎᎸ.

source: You naughty kittens!
chr: ᏂᎯ ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ!

source: You naughty kittens.
chr: ᏂᎯ ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ.

source: You naughty, naughty kittens!
chr: ᏂᎯ ᎢᏥᏲ, ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ!

source: You put them on the roof.
chr: ᎦᏌᎾᎵᎢ ᏕᏣᏝᏅ.

source: You saw us hunt for them.
chr: ᏙᎩᏯᎸᏒᎢ ᏣᎪᎲ.

source: You shall have no pie.
chr: ᎨᎵᏍᏘᎩ ᎥᏝ ᏱᏓᏥᎯ.

source: You should keep them clean.
chr: ᏗᎦᏓᎭ ᏄᎾᎵᏍᏔᏅᎾ ᏂᏣᏛᏁᎸᎭ.

source: You should not lose them.
chr: ᎥᏝ ᏱᏕᏥᏲᎱᏎᎸᎭ.

source: You should take care of your mittens.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏣᎵᏏᏅᏓᏅᎭ.

source: You stole our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏣᏃᏍᎩᏒ.

source: “Where are we all going?
chr: “ᎭᏢ ᎣᏤᎦ?
